# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\karunmj\Documents\GitHub\m2m\hardware\psoc5\PSoC_Datalogger_SMS.cydsn\PSoC_Datalogger_SMS.cyprj
# Date: Mon, 02 Jun 2014 04:21:57 GMT
#set_units -time ns
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {emFile_1_Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_SAR_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_SAR_1_theACLK(fixed-function)} -period 83.333333333333329 -waveform {0 41.6666666666667} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {uart_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {NEOMOTE_1_UART_MOTE_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {uart_ultrasonic_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 313 627} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {uart_solinst_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 313 627} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {SlowClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 576001 1200001} [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {SlowClock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 576001 1200001} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus_glb_ff}]


# Component constraints for C:\Users\karunmj\Documents\GitHub\m2m\hardware\psoc5\PSoC_Datalogger_SMS.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\karunmj\Documents\GitHub\m2m\hardware\psoc5\PSoC_Datalogger_SMS.cydsn\PSoC_Datalogger_SMS.cyprj
# Date: Mon, 02 Jun 2014 04:21:41 GMT
